CheckWear = {
  Index  = {1, 3, 6, 8, 9},
  Item = {
    ['ÄĞ×Ó»Æ½ğ»¤Íó'] = 1,
    ['Å®×Ó»Æ½ğ»¤Íó'] = 1,
    ['ÄĞ×ÓÔÂ¹â»¤Íó'] = 2,
    ['Å®×ÓÔÂ¹â»¤Íó'] = 2,	
    ['ÄĞ×ÓºÚÁú»¤Íó'] = 3,
    ['Å®×ÓºÚÁú»¤Íó'] = 3,	
    ['ÄĞ×ÓÌ«¼«»¤Íó'] = 4,
    ['Å®×ÓÌ«¼«»¤Íó'] = 4,	
    ['ÄĞ×ÓÖÁ×ğ»¤Íó'] = 5,
    ['Å®×ÓÖÁ×ğ»¤Íó'] = 5,	
	
    ['ÄĞ×Ó»Æ½ğÕ½Ñ¥'] = 1,
    ['Å®×Ó»Æ½ğÕ½Ñ¥'] = 1,
    ['ÄĞ×ÓÀû³İÑ¥'] = 2,
    ['Å®×ÓÀû³İÑ¥'] = 2,
    ['ÄĞ×ÓºÚÁúÕ½Ñ¥'] = 3,
    ['Å®×ÓºÚÁúÕ½Ñ¥'] = 3,
    ['ÄĞ×ÓÌ«¼«Ğ¬'] = 4,
    ['Å®×ÓÌ«¼«Ğ¬'] = 4,	
    ['ÄĞ×ÓÖÁ×ğÕ½Ñ¥'] = 5,
    ['Å®×ÓÖÁ×ğÕ½Ñ¥'] = 5,	
	
    ['ÄĞ×Ó»ÆÁú¹­·ş'] = 0,
    ['Å®×Ó»ÆÁú¹­·ş'] = 0,
    ['ÄĞ×Ó»Æ½ğîø¼×'] = 1,
    ['Å®×Ó»Æ½ğîø¼×'] = 1,
    ['ÄĞ×ÓÑı»ªÅÛ'] = 2,
    ['Å®×ÓÑı»ªÅÛ'] = 2,
    ['ÄĞ×Ó°×ÁúÕ½¼×'] = 3,
    ['Å®×Ó°×ÁúÕ½¼×'] = 3,
    ['ÄĞ×ÓºÚÁúÕ½¼×'] = 3,
    ['Å®×ÓºÚÁúÕ½¼×'] = 3,
    ['ÄĞ×ÓÌ«¼«µÀÅÛ'] = 4,
    ['Å®×ÓÌ«¼«µÀÅÛ'] = 4,
    ['ÄĞ×ÓÖÁ×ğµÀÅÛ'] = 5,
    ['Å®×ÓÖÁ×ğµÀÅÛ'] = 5,
	
    ['ÄĞ×Ó¶·óÒ'] = 1,
    ['Å®×Ó¶·óÒ'] = 1,
    ['ÄĞ×ÓÑı»ªÃ±'] = 2,
    ['Å®×ÓÑı»ªÃ±'] = 2,
    ['ÄĞ×ÓºÚÁúÃ±'] = 3,
    ['Å®×ÓºÚÁúÃ±'] = 3,
    ['ÄĞ×ÓÌ«¼«µÀ¹Ú'] = 4,
    ['Å®×ÓÌ«¼«µÀ¹Ú'] = 4,
    ['ÄĞ×ÓÖÁ×ğ¶·óÒ'] = 5,
    ['Å®×ÓÖÁ×ğ¶·óÒ'] = 5,
	
    ['µñ»ğÁúÌ×'] = 0,
    ['ÒøÀÇÆÆ»Ê½£'] = 0,
    ['ÁÒ×¦'] = 0,
    ['ÁúºŞ'] = 0,
    ['»ÆÁú¸«'] = 0,
    ['»ÆÁú¹­'] = 0,
    ['»ÆÁú¶·¼×'] = 0,
	
    ['»Æ½ğÊÖÌ×'] = 1,
    ['Èı²æ½£'] = 1,
    ['ĞÂÂŞ±¦½£'] = 1,
    ['Èı²æêª'] = 1,
    ['¹ğÁÖÖñÇ¹'] = 1,
    ['ÅÍÁú¸«'] = 1,
	
    ['ºüÀêÊÖÌ×'] = 2,
    ['Áú¹â½£'] = 2,
    ['ÔÂ¹âµ¶'] = 2,
    ['ÀÇÑÀêª'] = 2,
    ['Ñ×µÛ»ğÁé¸«'] = 2,
    ['ËÄ¼¾¼×ëĞ'] = 2,
    ['ÇıÄ§ÁÒ»ğ¹­'] = 2,
	
    ['¾Å·¨ÊÖÌ×'] = 3,
    ['Èı·É½£'] = 3,
    ['°ëÔÂµ¶'] = 3,
    ['ÂŞººÖñÇ¹'] = 3,
    ['¾üÉñé³'] = 3,
	
    ['Ì«¼«ÊÖÌ×'] = 4,
    ['Ì«¼«ÈÕ½£'] = 4,
    ['Ì«¼«ÔÂµ¶'] = 4,
    ['Ì«¼«ÉñÇ¹'] = 4,
    ['Ì«¼«¸«'] = 4,
	
    ['ÎŞ¼«Õ½È­'] = 5,
    ['°ÔÍõ½£'] = 5,
    ['ÌìÍõµ¶'] = 5,
    ['Õ½Ììêª'] = 5,
    ['µÛÍõ¸«'] = 5,
    ['ÖÁ×ğ¶·¼×'] = 5,
    ['ÖÁ×ğ¹­'] = 5,
  },
}

--ÅĞ¶Ï×°±¸
CheckWear.Get = function(uSource, uIndex, uNum)
  local n = 0;
  for k = 1, #CheckWear.Index do
	local ItemName = P_getitem(uSource, 1, 'rName', CheckWear.Index[k])
	if CheckWear.Item[ItemName] ~= nil and CheckWear.Item[ItemName] >= uIndex then 
	  n = n + 1;
	  if n >= uNum then 
	    return true;
	  end;
	end;
  end
  return false;
end