{******************************************************************************
创建人:杨李
创建时间:2009.10.23
修改时间:
实现功能:

   被攻击 召唤怪物'远距离野神族2'4个

******************************************************************************}

//被攻击

procedure OnCallObject(uHit, uSelf:integer);
begin
    if MapFindMonster('东海沼泽', '远距离野神族2', 'all') > 0 then exit;
    MapAddmonster('东海沼泽', '远距离野神族2', 129, 317, 1, 0, '', 0, 0,TRUE); //增加怪物
    MapAddmonster('东海沼泽', '远距离野神族2', 132, 322, 1, 0, '', 0, 0,TRUE); //增加怪物
    MapAddmonster('东海沼泽', '远距离野神族2', 137, 323, 1, 0, '', 0, 0,TRUE); //增加怪物
    MapAddmonster('东海沼泽', '远距离野神族2', 142, 321, 1, 0, '', 0, 0,TRUE); //增加怪物
end;

