{******************************************************************************
创建人:田莉
创建时间:2009.07
修改时间:2009.08.05
实现功能:
  妖华死亡之后 ’九尾狐酒母‘变身成'九尾狐变身'

   //已验证
******************************************************************************}

procedure OnTurnOn(uSource, uDest :integer);
begin
  worldnoticemsg('<九尾狐变身>：是谁杀了我的妖华？', $000080FF, 0);
  MapDelnpc('长城以南', '九尾狐酒母'); //直接删除九尾狐酒母
  if MapFindMonster('长城以南', '九尾狐变身','all') <= 0 then //查找九尾狐变身 成功
    MapAddmonster('长城以南', '九尾狐变身', 127, 328, 1, 4, '', 0, 0,TRUE); //增加九尾狐变身
end;

