{******************************************************************************
创建人:杨李
创建时间:2009.10.26
修改时间:
实现功能:

   被攻击 召唤怪物'远距离野神族2'4个

******************************************************************************}


//被攻击

procedure OnCallObject(uHit, uSelf:integer);
begin
if MapFindMonster('北海雪原', '远距离野神族2', 'all') > 0 then exit;
    MapAddmonster('北海雪原', '远距离野神族2', 226, 148, 1, 0, '', 0, 0,TRUE); //增加怪物
    MapAddmonster('北海雪原', '远距离野神族2', 227, 155, 1, 0, '', 0, 0,TRUE); //增加怪物
    MapAddmonster('北海雪原', '远距离野神族2', 232, 154, 1, 0, '', 0, 0,TRUE); //增加怪物
    MapAddmonster('北海雪原', '远距离野神族2', 237, 149, 1, 0, '', 0, 0,TRUE); //增加怪物
end;

