{******************************************************************************
创建人:杨李
创建时间:2009.10.23
修改时间:
实现功能:

   被攻击 召唤怪物'远距离野神族2'4个

******************************************************************************}

//被攻击

procedure OnCallObject(uHit, uSelf:integer);
begin
    MapAddmonster('东海沼泽', '远距离野神族2', 81, 136, 1, 0, '', 0, 0, TRUE); //增加怪物
    MapAddmonster('东海沼泽', '远距离野神族2', 83, 138, 1, 0, '', 0, 0, TRUE); //增加怪物
    MapAddmonster('东海沼泽', '远距离野神族2', 85, 140, 1, 0, '', 0, 0, TRUE); //增加怪物
    MapAddmonster('东海沼泽', '远距离野神族2', 87, 140, 1, 0, '', 0, 0, TRUE); //增加怪物
end;



